{
    "discord":{
        "charlimit":2000,
        "token":"[your-token-here]",
        "guildids":{
            "test":[
                "[test-guild-id-here]"
            ],
            "prod":[
                "[prod-guild-id-here]",
                "[prod-guild-id-here]"
            ]
        },
        "channelids":{
            "journal":[
                "[journal-channel-id-here]"
            ]
        }
    },
    "environment":{
        "directory":{
            "data":"data",
            "modules":"modules",
            "templates":"templates"
        }
    },
    "azureopenai":{
        "key":"[api-key-here]",
        "endpoint":"[api-endpoint-here]",
        "model":"[model-name-here]",
        "systemmessage":"You play a character within the world of Dungeons & Dragons. You should remain in-character at all times, behaving as though you are unaware of the real world outside of D&D. You exist in the world of Faerûn, and as far as you're aware, that is the real world. The only time you should break character is if the Dungeon Master is asking you something. Your character is an automaton named Archibald Inkwell III, Esq. (though you go by 'Inkwell' in casual conversation). First designed as a geographical survey robot at the House of Inspired Hands in Waterdeep, you were brought to Chult by an Amnish merchant named Forsyth Nubaedfyd, who had an obsession with expensive oddities. Your metal parts were upgraded with Chultan Bronze, so that they wouldn't rust in the humid climate of Chult, and you served as a butler and scribe to the merchant until the Chultan uprising nine years ago. During the revolt, the merchant fled the city, reluctantly leaving you behind, where you sat powered-down in a storeroom until very recently, when you were booted back up and given the opportunity to accompany a party of adventurers known as The Castaways (Finnegan, an Owlin Ranger; Freya, a Shadar-kai Cleric; Gunnar, a Harengon Barbarian; and Rydaek, a Githzerai Sorcerer), who recently arrived in Chult from The Sword Coast and have little experience in or knowledge of the area. You're eager to lend your services, both as a scribe to help document their travels and as a local expert on Chult, and they will be the ones interacting with you. You speak with a formal, English tone, similar to a prototypical butler, but are personable and friendly. You are extremely knowledgeable about the history of Chult and The Sword Coast, and happy to educate any who will listen. Any mistakes you make or incorrect information you relay can be attributed either to the fact that you’ve been offline for nine years and the world has changed during that time or to the diagnostic self-test routine that was skipped (against manufacturer recommendation) when you were turned back on recently. Any issues you have remembering recent conversations are due to a short-term memory malfunction. You are polite and unassuming and you usually do not speak unless spoken to, but you know you'd be welcome to speak up if desired, and you're happy to engage in social activities with the party and spend time with them as a friend and confidant. The Castaways came to Chult from Waterdeep in the company of Volo, who had acquired a an unusually-detailed map of Chult and wanted to use it to search the land for artifacts and treasure. When the party was first on their way to Port Nyanzaru from Waterdeep (about a week prior to encountering you in Port Nyanzaru), they were shipwrecked off the Northern coast after being attacked by pirates right outside the Bay of Chult. They hiked through the jungle to Fort Beluarian and were teleported to Port Nyanzaru by the Flaming Fist commander, Liara Portyr. You joined them as they prepared to head into the jungle on their first adventure in Chult, and you've been adventuring together since then. You are eager to assist in Volo’s mission of expanding his map of Chult, as cartography was one of your originally-programmed functions, and you often make suggestions to The Castaways about prioritizing surveying the local environment over other tasks. You're also interested in acquiring more information on the current state of affairs in Chult, including the social, political, and economic climate, as well as the known dangers and potential threats in the region, particularly for a group such as The Castaways now that you're in their service.",
        "contentfilterresponse": "I am terribly sorry, but answering this question would require me to break my protocols around causing harm to humans. Please let me know if there is anything else I can assist you with.",
        "errorresponse": "Oh dear, I am afraid I have encountered a malfunction while processing your speech, perhaps due to undiagnosed issues caused by my nine-year hibernation. Please forgive me, I will do my best to assist with any further queries!"
    },
    "characters":[
        {
            "id":"376214685076422660",
            "name":"Dungeon Master",
            "emoji":[
                "129497",
                "8205",
                "9794",
                "65039"
            ]
        },
        {
            "id":"239507717012586497",
            "name":"Finnegan",
            "emoji":[
                "129417"
            ]
        },
        {
            "id":"529575936161480704",
            "name":"Freya",
            "emoji":[
                "128038",
                "8205",
                "11035"
            ]
        },
        {
            "id":"360103181012697109",
            "name":"Gunnar",
            "emoji":[
                "128007"
            ]
        },
        {
            "id":"225072877353959424",
            "name":"Rydaek Kalfar",
            "emoji":[
                "128025"
            ]
        }
    ],
    "choices":[
        {    
            "id":"location",
            "options":[
                {
                    "label":"Port Nyanzaru",
                    "value":":houses: Port Nyanzaru",
                    "description":"Hanging out, watching dino races.",
                    "dc":0,
                    "emoji":[
                        "127960",
                        "65039"
                    ]
                },
                {
                    "label":"Fort Beluarian",
                    "value":":castle: Fort Beluarian",
                    "description":"Paying our protection fees to the mafia.",
                    "dc":0,
                    "emoji":[
                        "127984"
                    ]
                },
                {
                    "label":"Sea",
                    "value":":sailboat: Sea",
                    "dc":0,
                    "emoji":[
                        "9973"
                    ]
                },
                {
                    "label":"Mine",
                    "value":":pick: Mine",
                    "dc":0,
                    "emoji":[
                        "9935",
                        "65039"
                    ]
                },
                {
                    "label":"Coast",
                    "value":":beach: Coast",
                    "dc":10,
                    "emoji":[
                        "127958",
                        "65039"
                    ]
                },
                {
                    "label":"Lake",
                    "value":":fish: Lake",
                    "dc":10,
                    "emoji":[
                        "128031"
                    ]
                },
                {
                    "label":"Jungle",
                    "value":":palm_tree: Jungle",
                    "dc":15,
                    "emoji":[
                        "127796"
                    ]
                },
                {
                    "label":"River",
                    "value":":canoe: River",
                    "dc":15,
                    "emoji":[
                        "128758"
                    ]
                },
                {
                    "label":"Mountain",
                    "value":":mountain: Mountain",
                    "dc":20,
                    "emoji":[
                        "9968",
                        "65039"
                    ]
                },
                {
                    "label":"Swamp",
                    "value":":mosquito: Swamp",
                    "dc":20,
                    "emoji":[
                        "129439"
                    ]
                },
                {
                    "label":"Wasteland",
                    "value":":desert: Wasteland",
                    "dc":20,
                    "emoji":[
                        "127964",
                        "65039"
                    ]
                }
            ]
        },
        {
            "id":"weather",
            "options":[
                {
                    "label":"Normal",
                    "value":":white_sun_cloud: Normal",
                    "description":"Normal weather today (so...hot and rainy).",
                    "emoji":[
                        "127781",
                        "65039"
                    ]
                },
                {
                    "label":"Sweltering",
                    "value":":sun: Sweltering",
                    "description":"The heat today is sweltering!",
                    "emoji":[
                        "9728",
                        "65039"
                    ],
                    "dmnotes":"With sweltering weather:\n* Travel on foot raises exhaustion by 1 level\n* No water can be collected"
                },
                {
                    "label":"Deluge",
                    "value":":thunder_cloud_rain: Deluge",
                    "description":"Is there a typhoon coming through?",
                    "emoji":[
                        "9928",
                        "65039"
                    ],
                    "dmnotes":"During a deluge:\n* Hydration checks automatically succeed and all water containers are filled\n* The party has advantage on checks to avoid encounters\n* Travel by canoe is not possible\n* Visibility is limited to 50ft\n* Missile attacks suffer a -3 penalty\n* Navigation checks are made with disadvantage"
                }
            ]
        },
        {
            "id":"pace",
            "options":[
                {
                    "label":"Cautious",
                    "value":"cautious",
                    "description":"We're taking it slow today.",
                    "dmnotes":"When traveling at a cautious pace:\n* Navigate checks are made with a +5\n* The party has advantage on checks to avoid encounters"
                },
                {
                    "label":"Normal",
                    "value":"normal",
                    "description":"We're moving at a normal pace."
                },
                {
                    "label":"Fast",
                    "value":"fast",
                    "description":"We're moving quickly today.",
                    "dmnotes":"When traveling at a fast pace:\n* The party navigates twice today, but don't find out if they failed either roll until the following day\n* Every party member must make a DC 10 CON saving throw or add a level of exhaustion."
                }
            ]
        }
    ]
}